In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
mall_cus = pd.read_csv("Mall_Customers.csv", sep=",")
mall_cus

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [3]:
x = mall_cus.drop(columns=['CustomerID', 'Genre', 'Age'])
x

     Annual Income (k$)  Spending Score (1-100)
0                    15                      39
1                    15                      81
2                    16                       6
3                    16                      77
4                    17                      40
..                  ...                     ...
195                 120                      79
196                 126                      28
197                 126                      74
198                 137                      18
199                 137                      83

[200 rows x 2 columns]

In [4]:
from sklearn.cluster import DBSCAN

In [6]:
dbscan = DBSCAN(eps=1,min_samples=3)
dbscan.fit(x)

DBSCAN(eps=1, min_samples=3)

In [7]:
dbscan.labels_

array([-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,  0, -1,  0, -1, -1,
        0, -1, -1, -1, -1, -1,  1,  2,  2,  1,  2, -1,  2,  2, -1, -1, -1,
        1, -1, -1, -1, -1, -1, -1,  3, -1,  4, -1, -1,  3,  4,  3,  4, -1,
       -1, -1, -1,  4, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,  5, -1,  5, -1,
       -1, -1,  5, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1], dtype=int64)

In [8]:
set(dbscan.labels_)

{-1, 0, 1, 2, 3, 4, 5}

In [9]:
# (-1) represents noise / outlier

In [13]:
x['cluster_number']=dbscan.labels_

In [14]:
x

     Annual Income (k$)  Spending Score (1-100)  cluster_number
0                    15                      39              -1
1                    15                      81              -1
2                    16                       6              -1
3                    16                      77              -1
4                    17                      40              -1
..                  ...                     ...             ...
195                 120                      79              -1
196                 126                      28              -1
197                 126                      74              -1
198                 137                      18              -1
199                 137                      83              -1

[200 rows x 3 columns]

In [12]:
from sklearn.metrics import rand_score, jaccard_score, silhouette_score

In [15]:
# For rand score and jaccard score we require ground truth dataset also

In [17]:
silhouette_score(x, dbscan.labels_)

-0.4152514886476401

In [ ]:
# We see that the silhouette score is negative indicating that the clusters formed are not very good. We can imagine
# 1 cluster within another cluster